Revit 2026 API

# FabricationNetworkChangeServiceSetSelection Method

---
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FabricationNetworkChangeServiceResult SetSelection(
	ISet<ElementId> selection
)
```
```vb
Public Function SetSelection (
	selection As ISet(Of ElementId)
) As FabricationNetworkChangeServiceResult
```
```cpp
public:
FabricationNetworkChangeServiceResult SetSelection(
	ISet<ElementId^>^ selection
)
```
```fsharp
member SetSelection :
        selection : ISet<ElementId> -> FabricationNetworkChangeServiceResult
```

#### Parameters

selection ISetElementId

#### Return Value

FabricationNetworkChangeServiceResult

#### Reference

FabricationNetworkChangeService Class

Autodesk.Revit.DB.Fabrication Namespace